Revit 2026 API

# ConnectorGetMEPConnectorInfo Method

---

Gets MEP connector information.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public MEPConnectorInfo GetMEPConnectorInfo()
```
```vb
Public Function GetMEPConnectorInfo As MEPConnectorInfo
```
```cpp
public:
MEPConnectorInfo^ GetMEPConnectorInfo()
```
```fsharp
member GetMEPConnectorInfo : unit -> MEPConnectorInfo
```

#### Return Value

MEPConnectorInfo Returns  if there is no MEP connector information associated.

#### Reference

Connector Class

Autodesk.Revit.DB Namespace